perf/dictionary.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
      variables:
        word:
          - "monkey"
          - "word"
          - "football"
          - "artillery"
          - "dream"
  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections
    

scenarios:
  - name: base
    flow:
      - get:
          url: '/dictionary?word={{ word }}&cached=false'
    phases:
      - name: Ramp
        duration: 30
        arrivalRate: 1
        rampTo: 5
      - name: Plain
        duration: 60
        arrivalRate: 5

  - name: peak_sustained
    flow:
      - get:
          url: '/dictionary?word={{ word }}&cached=true'
    phases:
      - name: Ramp
        duration: 30
        arrivalRate: 1
        rampTo: 5
      - name: Plain
        duration: 60
        arrivalRate: 5
      - name: Ramp
        duration: 60
        arrivalRate: 5
        rampTo: 20
      - name: Ramp
        duration: 60
        arrivalRate: 20
        rampTo: 50

  - name: peak_hard
    flow:
      - get:
          url: '/dictionary?word={{ word }}&cached=false'
    phases:
      - name: Ramp
        duration: 30
        arrivalRate: 1
        rampTo: 5
      - name: Plain
        duration: 60
        arrivalRate: 5
      - name: Ramp
        duration: 60
        arrivalRate: 5
        rampTo: 20
      - name: Ramp
        duration: 60
        arrivalRate: 20
        rampTo: 50

  - name: peak_sustained_mid
    flow:
      - get:
          url: '/dictionary?word={{ word }}&cached=true'
    phases:
      - name: Ramp
        duration: 30
        arrivalRate: 1
        rampTo: 5
      - name: Ramp
        duration: 60
        arrivalRate: 5
        rampTo: 20
      - name: Ramp
        duration: 60
        arrivalRate: 20
        rampTo: 50