perf/quotes.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections
  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 5
    - name: Ramp
      duration: 60
      arrivalRate: 5
      rampTo: 10
    - name: Ramp
      duration: 60
      arrivalRate: 10
      rampTo: 20
    - name: Plain
      duration: 120
      arrivalRate: 20

scenarios:
  - name: quotes_base
    flow:
      - get:
          url: '/quote'